import 'package:flutter/material.dart';
import 'package:flutter_bloc/flutter_bloc.dart';
import 'package:icons_flutter/icons_flutter.dart';

import '../services/bloc_service.dart';

class ArticleInside extends StatefulWidget {
  const ArticleInside({super.key});

  @override
  State<ArticleInside> createState() => _ArticleInsideState();
}

class _ArticleInsideState extends State<ArticleInside> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          title: InkWell(
            onTap: (){
              BlocProvider.of<NavigationBloc>(context)
                  .add(NavigationEvent.navigateToArticlePage);
            },
            child: const Icon(Icons.arrow_back_ios,color: Colors.black,),
          ),
        ),
        body: Container(
          margin: const EdgeInsets.only(left: 20, right: 20, bottom: 20),
          child: ListView(
            children: [
              Container(
                height: 228,
                width: double.infinity,
                decoration: BoxDecoration(
                  image: const DecorationImage(
                      image: AssetImage("assets/images/article.jpg"),
                      fit: BoxFit.cover),
                  borderRadius: BorderRadius.circular(20),
                ),
              ),
              const SizedBox(
                height: 20,
              ),
              const Text(
                "Payg'ambarlikdan oldingi davr",
                style: TextStyle(
                  fontSize: 18,
                  fontWeight: FontWeight.w700,
                ),
              ),
              const SizedBox(
                height: 10,
              ),
              const Row(
                children: [
                  Icon(
                    Feather.calendar,
                    size: 18,
                  ),
                  SizedBox(
                    width: 5,
                  ),
                  Text(
                    "30.09.2023",
                    style: TextStyle(
                      fontSize: 14,
                      fontWeight: FontWeight.w400,
                    ),
                  ),
                  SizedBox(
                    width: 26,
                  ),
                  Icon(
                    Feather.eye,
                    size: 18,
                  ),
                  SizedBox(
                    width: 5,
                  ),
                  Text("124",
                      style: TextStyle(
                        fontSize: 14,
                        fontWeight: FontWeight.w400,
                      )),
                  SizedBox(
                    height: 12,
                  ),
                ],
              ),
              const SizedBox(
                height: 38,
              ),
              const Text(
                "Расулуллоҳ соллаллоҳу алайҳи васалламнинг туғилишлари Бисмиллаҳир Роҳманир Роҳийм. Аллоҳ таолога битмас-туганмас ҳамду санолар бўлсин. Пайғамбаримизга мукаммал ва батамом салавоту дурудлар бўлсин.  Белгилаган соат етиб, Яратганнинг буюк хабарини бутун инсониятга етказиш учун Аллоҳнинг Ҳабиби Муҳаммад Мустафо соллаллоҳу алайҳи васаллам дунёга келдилар. «Фил йили» Рабиул аввал ойида инсонларнинг энг яхшиси Расулуллоҳ соллаллоҳу алайҳи васаллам туғилдилар. У Зотнинг таваллуд топган кунлари милодий тақвимнинг 571 йил апрел ойи охирги ўн кунлигига тўғри келади. Имом Бухорийнинг устози Иброҳим ибн Мунзир шундай деганлар: «Олимларда Пайғамбармиз соллаллоҳу алайҳи васаллам Фил йилида туғилганликлари ҳақида ҳеч қандай шубҳа йўқ». Амакисидан эшитган Абдуллоҳ ибн Ваҳб ибн Замъат Набий алайҳиссалом волидалари  Омина онамиздан ривоят қилади: “Бошим қоронғу эканлигини ҳис қилмадим ва бошқа аёллар каби ҳеч қандай оғирликни сезмадим. Бир кун уйқу ва уйғоқлик ҳолати оралиғида бўлганимда бир киши келиб мендан сўради: «Ҳомиладорликни сезяпсанми?» Мен: «Билмадим», – деб жавоб бердим. У: «Дарҳақиқат, сен юрагинг остида бу умматнинг Ҳожаси ва Пайғамбарини кўтариб юрибсан. Унинг дунёга келиши билан Шомдаги Басра саройлари нурга тўлади. Туғилажак фарзандингга Муҳаммад исмини қўйгин», – деди. Ой куним яқинлашганда эса ўша киши ёнимга келиб, яккаю ягона Аллоҳдан «боламни ҳасадчилардан сақлагин», деб сўрашни ўргатди. Байҳаки ва Ибн Исъҳоқ ҳам шунга ўхшаш ривоят келтиришган.  Атрофни ёритган нур  Усмон ибн Абул Осс розиаллоҳу анҳудан ривоят қилинади: «Пайғамбаримиз соллаллоҳу алайҳи васалламнинг волидаларини тўлғоқ тутган тунда ўша ерда бўлган онам сўзлаб берганди: «Хонада нимаики нарса бўлса, бари нурга тўлганди. Осмонга боқсам, юлдузлар шунчалик паст жойлашгандики, ҳозир устимга қулаб тушадигандек эди. Набий алайҳиссалом туғилганларида, у зотнинг волидаларидан шундай нур чиқдики, у хонани ва бутун уйни мунаввар қилганидан, кўзимга фақат нур кўринарди», – деб. Ал Хатиб Ал Боғдодий ривоят қилади: «Омина онамиз: «Фарзандимни дунёга келтирганимда нур таратувчи катта оқ булут кўрдим», – деган эканлар.  Омина онамиздан эшитган Халима розияллоҳу анҳодан ривоят қилинади:  Ибн Хиббон айтади: «Ҳақиқатан, бу ўғлим ўзгачадир. Юрагим остидалигида бошқа аёллар каби оғирлик сезмаганман. У мен учун жуда енгил эди. Мен бунга ўхшаш баракотли бола кўрмаганман. Уни дунёга келтирганимда, ичимдан ёрқин юлдуздек нур чиққанини кўрдим. Бу нур Басрадаги туяларнинг бўйинларини ёритди. Дунёга келганида болам бошқа чақалоқлар каби ётиб олмасдан, қўлларини ерга қўйиб, бошини осмонга кўтарди», – деган эканлар».  Расулуллоҳ соллаллоҳу алайҳи васалламнинг туғилишлари Ибн Ҳишомнинг «Сийрат» китобида келтирилган яҳудийларнинг сўзлари: «Ҳассон ибн Собитдан ривоят қилинади: «Аллоҳга қасамки, мен ўшанда етти ёки саккиз ёшда эдим. Эшитган гапларимнинг маъносини англаб етардим. Ясрибнинг минораларидан бирида туриб бор овози билан бақираётган яҳудийнинг сўзларини эшитдим. Атрофида одамлар тўпланиб, ундан нимага дод солаётганини сўрамагунга қадар бақираверди. «Ҳой ғаминг кўпайгур, сенга нима бўлди?», – деб сўрашганида у: «Дарҳақиқат, бугун осмонда Аҳмаднинг туғилишини башорат қилувчи юлдуз пайдо бўлди», – деб жавоб қайтарди. (Ибн Ҳишом, Абу Нуайм, Байҳақий).   «Субул ул ҳуда ва ар рашод» китобида шундай дейилган: «Ойша онамиз розиаллоҳу анҳодан ривоят қилинишича, Маккада савдогар яҳудий яшаган. Набий алайҳиссалом туғилган кечада у қурайшликлар мажлисига бориб улардан: «Бу кеча қабилангизда бола туғилмадими?» – деб сўраганда: «Аллоҳга қасамки, биз билмаймиз», – деган жавобни олди. Сўнг яҳудий курайшликларга қараб: «Гапларимни эслаб қолинглар. Бугун охирги бўлмиш бу умматнинг Набийси туғилди. Унинг кураклари ўртасида нубувват белгиси бўлиб, у от ёлидек туклидир», – деди. Каъб Ахбар розиаллоҳу анҳудан ривоят қилинади: «Пайғамбар Муҳаммад соллаллоҳу алайҳи васаллам онаси қорнидан чиқадиган вақт ҳақида Аллоҳ субҳанаҳу ва таоло Мусо алайҳиссаломга айтганини Тавротда кўрдим. Мусо алайҳиссалом ўз қавмига қачон фалон номли юлдуз қимирлаб ўз ўрнидан силжиса, ўшанда Муҳаммад соллаллоҳу алайҳи васаллам дунёга келади деб хабар берган. Бани Исроил аҳли илмлари орасида бу гап авлоддан авлодга ўтиб келган».  Ал Васидий раҳимаҳуллоҳдан ривоят қилинишича, Маккада Юсуф исмли бир яҳудий бўлган. Набий алайҳиссалом туғилганларида, қурайшликлардан биронтаси ҳали хабар топмагач у: «Ҳақиқатдан ҳам, бу кеча шу заминда бу умматнинг Пайғамбари туғилди», – деб қурайшликлар яшайдиган жойларни айланиб ҳеч қандай дарак топмади. Сўнг Абдулмуталлибдан бориб сўраганида, чиндан ҳам унинг фарзанди Абдуллоҳ ўғиллик бўлганини билди. Шунда яҳудий: «Таврот билан қасам ичаманки, дарҳақиқат, у Пайғамбардир», – деб айтди.  Расулуллоҳ соллаллоҳу алайҳи васаллам туғилишлари ҳақида у зотнинг волидаларининг ҳикояси:  Имом Абу Шамат роҳимаҳуллоҳ айтишича, Пайғамбаримиз соллаллоҳу алайҳи васаллам туғилганларида бутун атрофга таралган нур ҳақидаги ривоят қурайшликлар орасида оғиздан оғизга ўтиб тез-тез хотирланиб турарди.  Ибн Хажар ал Хайтами «Ал Минаҳ ал Маккия фи шарҳи ал Хамазия» китобида (125 бет) Ибн Аббос розиаллоҳу анҳудан ривоят келтиради: “Набий алайҳиссаломнинг волидалари: “Ҳомиладорликнинг олтинчи ойида бўлганимда, тушимда бир кишини кўрдим. У: «Эй, Омина! Сен қорнингда инсонларнинг энг яхшисини кутариб юрибсан. Кўзинг ёримагунга қадар ҳеч кимсага ҳолатинг тўғрисида сўзлама. Фарзандингга Муҳаммад деб исм қўй», – деди. Тўлғоқ бошланганда ҳеч ким бу ҳақида билмади. Ҳақиқатан, уйда бир ўзим эдим. Абдулмуталлиб эса Каъбани тавоф қилаётганди. Тўсатдан бир нима гумбурлаб, чўчиб кетдим. Сўнг бир оқ қуш қаноти билан юрагимни силаганида қўрқувим йўқ бўлди ва оғриғим ҳам кетди. Кейин оқ ичимлик тўлган идишга кўзим тушди. Уни ичишим билан ҳамма ёғим нурга тўлди. Сўнг хурмо дарахтидек баланд бўйли Абдулманноф қизларига ўхшаш аёлларни кўрдим. Атрофимда бўлаётган ишларга ҳайрон эдим, мен ҳақимда қаердан билганликларини сўраб улгурмасимдан олдин улар мени ўраб олишди”, – деб сўзлаб бергандилар.  Ибн Аббос розиаллоҳу анҳудан ривоят қилинган ҳадисда: “Набий алайҳиссаломнинг волидаларига у аёллар: «…Мен Фираъвнинг аёли Осиёман, бу Имрон қизи Марям, булар эса Жаннат ҳурлари», – деб жавоб беришган экан”.  Соат сайин гумбур-гумбур овози кучайиб, олдингиданда қўрқинчлироқ тус олаётганди. Шу ҳолатдалигимда осмон билан ер орасида улкан оқ ипакли мато кўринди. Кимдир менга: «Боланг туғилганда уни одамларнинг назаридан яширгин», – деди. Сўнг осмонда кумуш кўза ушлаб турган эркакларни кўрдим. Мен томон учиб келган ёқут қанотли зумрад тумшуқли қушлар галаси кўплигидан, хонамдан осмон кўринмай қолди. Аллоҳ субҳанаҳу ва таоло ерни очиб қўйганида эса, Машриқдан Мағрибгача бўлган ерларни ҳамда биттаси Шарқда, иккинчиси Ғарбда, учинчиси эса Каъбада ўрнатилган байроқларни кўрдим. Шундан сўнг кўзим ёриб Муҳаммад (соллаллоҳу алайҳи васаллам)ни дунёга келтирдим. Унга боққанимда, тавозе билан ибодат қилаётган инсон каби икки кўрсаткич бармоқларини осмонга кўтариб сажда қилаётган ҳолатда эди. Сўнг кўкдан бир оқ булут тушдида, бизларни ўраб олиб, Муҳаммад (соллаллоҳу алайҳи васаллам)ни олиб кетди. Кейин мен: “У билан бирга Шарқдан ­Ғарбгача бўлган ерларни айланиб чиқинглар. Уни денгизларга олиб боринглар. Барча унинг исмини ва шаклу-шамойилини кўрсин. Ва денгиздагилар билсинларки, унинг исми маъноси «йўқ қилувчидир». Негаки унинг даврида ширкдан ҳеч вақо қолмас. У ширкни йўқ қилади”, – деб гапириб берганлар.  Ибн Исъҳоқдан Ибн Ҳишом шундай ривоят қилади: “Набий алайҳиссалом туғилганларида, волидалари боболари Абдулмуталлибга ўғил набиралик бўлганликлари ва келиб кўришлари мумкинлиги ҳақида хабар юбордилар. Абдулмуталлиб набирасини кўргани келганида, Набий алайҳиссаломнинг волидалари ҳомиладор бўлиб, воқеаларнинг барини ҳамда туғилажак фарзандига қандай исм қўйиш ҳақида амр бўлганлигини гапириб берди. Айтишларича, Абдулмуталлиб набирасини қўлларига олган ҳолда Каъбанинг ичига кириб, Аллоҳ субҳанаҳу ва таолога дуолар қилиб шундай неъмат ато қилганига шукроналар келтирди. У ердан чиққач, Набий алайҳиссаломни онасига топшириб, набирасига эмизувчи аёл қидиришни бошлаб юборди.",
                style: TextStyle(
                  fontSize: 18,
                  fontWeight: FontWeight.w400,
                ),
              ),
            ],
          ),
        ));
  }
}
